app/controllers/sessions_controller.rb

	def create
		#newビューを表示
		# render 'new'

		user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "endo@binc.jp"]]