app/controllers/users_controller.rb

	def index
		# @users = User.all
		# @users = User.paginate(page: params[:page])
		@title = "All users"
    	@users = User.paginate(:page => params[:page])
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "remember_token") VALUES (?, ?, ?, ?, ?, ?)